[
  {
    "term": "Agile",
    "definition": "Гибкий подход к управлению проектами, основанный на итеративной разработке."
  },
  {
    "term": "API",
    "definition": "Интерфейс прикладного программирования — набор правил, по которым взаимодействуют программы."
  },
  {
    "term": "Backend",
    "definition": "Серверная часть сайта, отвечает за обработку данных и бизнес-логику."
  },
  {
    "term": "CI/CD",
    "definition": "Непрерывная интеграция и доставка — практика автоматизации разработки и деплоя ПО."
  },
  {
    "term": "CSS",
    "definition": "Язык описания стилей, используемый для оформления внешнего вида веб-страниц."
  },
  {
    "term": "Cloud Computing",
    "definition": "Облачные вычисления — предоставление ресурсов через интернет (серверы, БД и т.д.)."
  },
  {
    "term": "DevOps",
    "definition": "Подход к разработке, объединяющий процессы разработки и эксплуатации ПО."
  },
  {
    "term": "Docker",
    "definition": "Платформа для контейнеризации приложений — упрощает развертывание и масштабирование."
  },
  {
    "term": "Frontend",
    "definition": "Часть веб-приложения, которую видит и с которой взаимодействует пользователь."
  },
  {
    "term": "Framework",
    "definition": "Набор готовых компонентов и правил для упрощения разработки ПО."
  },
  {
    "term": "Git",
    "definition": "Система контроля версий, позволяющая отслеживать изменения в коде и работать в команде."
  },
  {
    "term": "HTML",
    "definition": "Язык разметки, используемый для создания структуры веб-страниц."
  },
  {
    "term": "IDE",
    "definition": "Интегрированная среда разработки — программа для написания, запуска и отладки кода."
  },
  {
    "term": "JavaScript",
    "definition": "Язык программирования, позволяющий добавлять интерактивность на веб-страницы."
  },
  {
    "term": "JSON",
    "definition": "Формат обмена данными, основанный на JavaScript и широко используемый в API."
  },
  {
    "term": "Kubernetes",
    "definition": "Система оркестрации контейнеров, автоматизирующая их развертывание и управление."
  },
  {
    "term": "Library",
    "definition": "Набор функций и классов, которые можно использовать в коде."
  },
  {
    "term": "MVC",
    "definition": "Архитектурный шаблон, разделяющий приложение на модель, представление и контроллер."
  },
  {
    "term": "Node.js",
    "definition": "Среда выполнения JavaScript на серверной стороне."
  },
  {
    "term": "NoSQL",
    "definition": "Тип баз данных, не использующих традиционные таблицы и SQL-запросы."
  },
  {
    "term": "Open Source",
    "definition": "Программное обеспечение с открытым исходным кодом, доступное для свободного использования и модификации."
  },
  {
    "term": "React",
    "definition": "JavaScript-библиотека для создания пользовательских интерфейсов от компании Meta."
  },
  {
    "term": "REST",
    "definition": "Стиль архитектуры API, основанный на использовании HTTP-запросов."
  },
  {
    "term": "SQL",
    "definition": "Язык структурированных запросов, используемый для работы с базами данных."
  },
  {
    "term": "Scrum",
    "definition": "Методология Agile, предполагающая работу в коротких циклах — спринтах."
  },
  {
    "term": "UI",
    "definition": "Пользовательский интерфейс — то, как система выглядит для пользователя."
  },
  {
    "term": "UX",
    "definition": "Пользовательский опыт — общее восприятие удобства и логичности интерфейса."
  },
  {
    "term": "VPN",
    "definition": "Виртуальная частная сеть, обеспечивающая защищённое соединение через интернет."
  },
  {
    "term": "Алгоритм",
    "definition": "Последовательность действий для решения задачи или достижения цели."
  },
  {
    "term": "База данных",
    "definition": "Организованная структура для хранения, поиска и управления данными."
  },
  {
    "term": "Брандмауэр",
    "definition": "Средство защиты компьютера или сети от несанкционированного доступа."
  },
  {
    "term": "Виртуализация",
    "definition": "Технология, позволяющая запускать несколько операционных систем на одном физическом устройстве."
  },
  {
    "term": "Деплой",
    "definition": "Процесс размещения приложения на сервере для использования пользователями."
  },
  {
    "term": "Инкапсуляция",
    "definition": "Скрытие внутренней реализации объекта и предоставление только необходимых интерфейсов."
  },
  {
    "term": "Кэш",
    "definition": "Временное хранилище данных для ускорения доступа к ним."
  },
  {
    "term": "Компилятор",
    "definition": "Программа, преобразующая исходный код в исполняемый файл."
  },
  {
    "term": "Конфликт слияния",
    "definition": "Ситуация в системах контроля версий, когда изменения в коде невозможно объединить автоматически."
  },
  {
    "term": "Куки",
    "definition": "Небольшие файлы, сохраняемые браузером для хранения информации о пользователе."
  },
  {
    "term": "Логика приложения",
    "definition": "Правила и процессы, определяющие поведение программы при выполнении задач."
  },
  {
    "term": "Массив",
    "definition": "Структура данных, представляющая собой упорядоченный набор элементов."
  },
  {
    "term": "Метод",
    "definition": "Функция, принадлежащая объекту или классу в объектно-ориентированном программировании."
  },
  {
    "term": "Модуль",
    "definition": "Отдельная часть программы, выполняющая конкретную задачу и способная взаимодействовать с другими частями."
  },
  {
    "term": "Нейронная сеть",
    "definition": "Математическая модель, вдохновлённая работой мозга, используемая в машинном обучении."
  },
  {
    "term": "Объект",
    "definition": "Сущность в объектно-ориентированном программировании, содержащая данные и методы для их обработки."
  },
  {
    "term": "Операционная система",
    "definition": "Программное обеспечение, управляющее ресурсами компьютера и взаимодействием пользователя с устройством."
  },
  {
    "term": "Отладка",
    "definition": "Процесс поиска и исправления ошибок в программе."
  },
  {
    "term": "Переменная",
    "definition": "Именованная область памяти, в которой хранится значение, используемое в программе."
  },
  {
    "term": "Плагин",
    "definition": "Дополнительный модуль, расширяющий функциональность основной программы."
  },
  {
    "term": "Порт",
    "definition": "Цифровой идентификатор, используемый для взаимодействия программ через сеть."
  },
  {
    "term": "Протокол",
    "definition": "Набор правил для обмена данными между устройствами или программами."
  },
  {
    "term": "Пул",
    "definition": "Коллекция ресурсов, используемых по мере необходимости, например, пул потоков."
  },
  {
    "term": "Роутинг",
    "definition": "Маршрутизация — процесс определения пути для передачи данных между узлами сети."
  },
  {
    "term": "Сервер",
    "definition": "Компьютер или программа, предоставляющая сервисы другим устройствам в сети."
  },
  {
    "term": "Сессия",
    "definition": "Период взаимодействия пользователя с приложением или сайтом, в течение которого сохраняется его состояние."
  },
  {
    "term": "Сниппет",
    "definition": "Небольшой фрагмент кода, часто используемый повторно."
  },
  {
    "term": "Фреймворк",
    "definition": "Каркас для разработки программ, предоставляющий готовую архитектуру и инструменты."
  },
  {
    "term": "Шаблон проектирования",
    "definition": "Типовое решение распространённой задачи проектирования программного обеспечения."
  },
  {
    "term": "Шифрование",
    "definition": "Процесс преобразования данных в защищённую форму для предотвращения несанкционированного доступа."
  }
]
